# Импорт библиотек
lapply(c("psych", "ggplot2", "gridExtra", "grid", "metan"), require, character.only = TRUE)

# =====================================================
#    EDA - Определение корреляции между переменными   #
# =====================================================
# Вывод 2 строк данных только с числовым типом
head(df_numeric_only, 2)
# Вывод 2 строк данных только с категориальным типом
df_factor_only <- df[, sapply(df, is.numeric) == F][, -1]
head(df_factor_only, 2)

# =====================================================
#    Определение корреляции числовых  переменных      #
#                 (до обработки данных)               #
# =====================================================
# Определение всех коэффициентов Пирсона для числовых переменных
all_numeric_cors <- corr_coef(df_numeric_only[, c(2:10)])
# Визуализация корреляции Пирсона
plot(all_numeric_cors)

# Визуализация корреляции Пирсона через psych-pairs
pairs.panels(df_numeric_only[, -1],
             hist.col = alpha("blue", 0.6),
             stars = T, ci = T, scale = T,
             main="Корреляция Пирсона для числовых переменных")

# =====================================================
#  Определение корреляции категориальных  переменных  #
#                 (до обработки данных)               #
# ===================================================== 

